=================== EDA (Exploratory Data Analysis) ==========================
1. Pandas             : Dataframe or data applications
2. numpy              : Numerical Python for math operation
3. matplotlib         : For plot graphs
4. Seaborn            : For plot graphs
5. Bokhe              : For Plots
6. plotly             : For Plots

============= Machine Learning ====================

7. scikit learn (Sklearn)   :ML models
8. stats                    : Statistical models

============= Data retrieval from SQL scrapping ====================

9. sqlite            : To connect with database
10. Beautiful Soup   : scrap the data from website
11. websocket        : scrapping

============= Deep Learning (DL) / CV (Computer Vision) ====================

12. Tensorflow      : Google. 
13. Keras           : DL model 
14. OpenCV          : For Image operations
15. pillow (PIL)    : For Image operations
16. pytorch         : Facebook.
17. Pretrained model :
   VGG16
   Mobilenet
   RESNET
   RCNN
   MASKRCNN
   FASTERCNN
   YOLO

============= Natural Language Process ====================

18. NLTK            : Natural Language Tool Kit
19. Scipy           : To solve MAthematical equations and algorithms
20. Word2Vec        : How words will convert to vector. 
21. Glove           : an unsupervised learning algorithm for obtaining vector representations for words
22. WordCLoud       : visualization technique commonly used to display tags or keywords from websites

===================== Hugging Face ============================

23. Transformers    : BERT (Bidirectional Encoder Representations from Transformers)

===================== GenAI models ============================

24. OpenAI + Microsoft  : GPT models
25. Google              : Gemini
26. Amazon              : Q
27. Meta                : LLaMA (Large Language Model Meta AI)
28. Apple               : ReALM (Reference Resolution As Language Modeling)

===================== LANGCHAIN ============================

29. LangChain is a framework to build with LLMs by chaining interoperable components.

===================== Deployments/ Applications ============================

30. Flask
31. Streamlit
32. Dango

===================== MLOps ============================

33. MLFlow
34. Kubeflow
35. Azure AI services  : Azure AI packages
36. GCP                : GCP PAckages

### Step 1: ###

### Create a DataFrame ###

**** We will create a dataframe using list

**** We will create a dataframe using dictionary

In [1]:
import pandas as pd

In [2]:
d1 = pd.DataFrame()
d1

Empty DataFrame
Columns: []
Index: []

In [3]:
type(d1)

pandas.core.frame.DataFrame

### Step 2: ###

### How to provide the data ###

In [4]:
names = ['tarun','surendar','mohith']
pd.DataFrame(names)    #Two-dimensional, size-mutable, potentially heterogeneous tabular data.
                    # Docstring:     
                    # Two-dimensional, size-mutable, potentially heterogeneous tabular data.
                    
                    # Data structure also contains labeled axes (rows and columns).
                    # Arithmetic operations align on both row and column labels. Can be
                    # thought of as a dict-like container for Series objects. The primary
                    # pandas data structure.

          0
0     tarun
1  surendar
2    mohith

In [6]:
names = ['tarun','surendar','mohith']
age = [20,21,22]
pd.DataFrame(zip(names,age))

          0   1
0     tarun  20
1  surendar  21
2    mohith  22

In [8]:
names = ['tarun','surendar','mohith']
age = [20,21,22]
city = ['hyd','blr','chn']
pd.DataFrame(zip(names,age,city))

          0   1    2
0     tarun  20  hyd
1  surendar  21  blr
2    mohith  22  chn

### Step 3: ###- Providethe column names

In [13]:
names = ['tarun','surendar','mohith']
pd.DataFrame(names, columns=['Name'])

       Name
0     tarun
1  surendar
2    mohith

In [20]:
names = ['tarun','surendar','mohith']
age = [20,21,22]
city = ['hyd','blr','chn']

data = zip(names,age,city)
cols = ['Name','Age','City']
pd.DataFrame(data,columns=cols)
# pd.DataFrame(zip(names,age,city),columns=['Name','Age','City'])

       Name  Age City
0     tarun   20  hyd
1  surendar   21  blr
2    mohith   22  chn

### Step4 ###
### Provide Index ###

In [23]:
names = ['tarun','surendar','mohith']
age = [20,21,22]
city = ['hyd','blr','chn']

data = zip(names,age,city)
cols = ['Name','Age','City']
ind= ['A','B','C']
pd.DataFrame(data,index=ind,columns=cols)

       Name  Age City
A     tarun   20  hyd
B  surendar   21  blr
C    mohith   22  chn

In [26]:
names = ['tarun','surendar','mohith']
age = [20,21,22]
city = ['hyd','blr','chn']

data = zip(names,age)
cols = ['Name','Age']
df = pd.DataFrame(data,index=city,columns=cols)
df

         Name  Age
hyd     tarun   20
blr  surendar   21
chn    mohith   22

- Create a DataFrame
- Add the columns data, provide the Column names
- Provide the index names

### Step 5
- Add new column on  existing DataFrame: To add a new Column, check number of rows in a DataFrame. New column also should have same number of rows.
- New column should be different to already existing Column names in DataFrame
- Syntax: dataframe[new_column_name] = new_column-data

In [14]:
import pandas as pd

names = ['tarun','surendar','mohith']
age = [20,21,22]
city = ['hyd','blr','chn']

col_data = zip(names,age,city)
col_names = ['Name','Age','City']
df = pd.DataFrame(col_data,columns=col_names)   # dataframe with 3 rows
print(df)

# Add Salary column with 3 values
salary = [60000,50000,85000]
df['Salary'] = salary
print(df)

       Name  Age City
0     tarun   20  hyd
1  surendar   21  blr
2    mohith   22  chn
       Name  Age City  Salary
0     tarun   20  hyd   60000
1  surendar   21  blr   50000
2    mohith   22  chn   85000

In [57]:
# Create an empty DataFrame. 
# Create 3 lists using list comprehension. 
# list1 should have values from 1 to 10
# list2 should have Square of 1 to 10
# list3 should have Cude of 1 to 10
# make a DataFrame with above 3 lists

df = pd.DataFrame()
list1 = [i for i in range(1,11)]
list2 = [i**2 for i in range(1,11)]
list3 = [i**3 for i in range(1,11)]

df['X'] = list1
df['Y'] = list2
df['Z'] = list3

print(df)

    X    Y     Z
0   1    1     1
1   2    4     8
2   3    9    27
3   4   16    64
4   5   25   125
5   6   36   216
6   7   49   343
7   8   64   512
8   9   81   729
9  10  100  1000

### Step 6:
- Update existing column data in a DataFrame
- If we want to add column with same name which is already exists, then existing column data will be overwrite

In [52]:
# Update Z column with i power 4.

list4 = [i**4 for i in range(1,11)]
df['Z'] = list4
print(df)

    X    Y      Z
0   1    1      1
1   2    4     16
2   3    9     81
3   4   16    256
4   5   25    625
5   6   36   1296
6   7   49   2401
7   8   64   4096
8   9   81   6561
9  10  100  10000

### Step 7:
- Remove/Drop the column
-  df.drop()
-  axis : {0 or 'index', 1 or 'columns'}, default 0
    Whether to drop labels from the index (0 or 'index') or
    columns (1 or 'columns'
   ex: df.drop(axis:1) or df.drop(axis: 'columns')
- columns : single label or list-like
              Column names to remove).
- inplace : bool, default False
    If False, return a cop of a DataFramey
     Otherwise, do operatio   in pla (Same DatFrame will overwrite)ce and return None.).

In [38]:
#Check the column names in a DataFrame

df.columns

Index(['X', 'Y', 'Z'], dtype='object')

In [58]:
df.drop('Y',               #  'Y' will be removed)
        axis= 1,    # axis= 'columns' or axis= 1 ===> Drop Columns
        inplace = True)    # inpalce = True ===> Same DataFrame will be replaced
                     
print(df)

    X     Z
0   1     1
1   2     8
2   3    27
3   4    64
4   5   125
5   6   216
6   7   343
7   8   512
8   9   729
9  10  1000

In [60]:
df.drop('Z',               #  'Z' will be removed)
        axis= 1)           # axis= 'columns' or axis= 1 ===> Drop Columns
                      
print(df)       # It will return column 'Z'. Because in the drop() we didn't mention "inplace = True". So it will not replace the dataframe. 
                # So drop() will return a copy of the dataframe

#######################################################
df2 = df.drop('Z',               #  'Z' will be removed
        axis= 1)                 # axis= 'columns' or axis= 1 ===> Drop Columns
print(df2)

    X     Z
0   1     1
1   2     8
2   3    27
3   4    64
4   5   125
5   6   216
6   7   343
7   8   512
8   9   729
9  10  1000
    X
0   1
1   2
2   3
3   4
4   5
5   6
6   7
7   8
8   9
9  10

- PRactice
- Read the Dataframe
- Provide the data to Dataframe
- Provide the column names
- CHange the index
- Add new column
- Drop a column
- Modify the existing column

### Step 8: ###
Drop the row
 - Process for Drop the column and drop the row is same
 - Only difference is Axis=0 will be used for Rows, Axis =1 will be used for COlumns
 - Axis = 0 represent Row
 - BY default Axis=0. MEans if we don't provide any value to Axis, then it will consider as Row

In [5]:
#Dataframe df1 
import pandas as pd
df1 = pd.DataFrame()
names_list = ['manoj','ashish','priya','teju']
city_list = ['hyd','viz','blr','chn']

df1['Name']= names_list
df1['City'] = city_list

print(df1)

     Name City
0   manoj  hyd
1  ashish  viz
2   priya  blr
3    teju  chn

In [8]:
df2 = df1.drop(2) # It will drop the row '2' and assign result DataFrame to df2 
print(df2)

     Name City
0   manoj  hyd
1  ashish  viz
3    teju  chn

In [13]:
df3 = df2.drop(2) # KeyError: '[2] not found in axis'. There is no row with '2'
print(df3)

KeyError: '[2] not found in axis'

In [16]:
#Drop multiple columns.
# To drop multiple columns, provide the indexes in a list
df2 = df1.drop([0,3])
print(df2)

     Name City
1  ashish  viz
2   priya  blr

In [17]:
df2 = df1.drop([0,3],axis=0)
print(df2)

     Name City
1  ashish  viz
2   priya  blr

In [19]:
print(df1)

     Name City
0   manoj  hyd
1  ashish  viz
2   priya  blr
3    teju  chn

In [21]:
df2 = df1.drop([0,3],axis=1)   #KeyError: '[0, 3] not found in axis'
print(df2)
#Getting error because axis=1 means it represents column. THere is no column with 0 or 3.

KeyError: '[0, 3] not found in axis'

### Step 9:
How to select a column
-

In [41]:
# Get the specific column data from a dataframe
print(df1['Name'])
#It will not return Column name in the result.
# It will return the data of the column 'Name'


# Series type
type(df1['Name'] ) #pandas.core.series.Series

0     manoj
1    ashish
2     priya
3      teju
Name: Name, dtype: object

pandas.core.series.Series

In [43]:
print(df1[['Name']])
# It will return Column name and column data as well.

# It is Data frame type
type(df1[['Name']])  #pandas.core.frame.DataFrame

     Name
0   manoj
1  ashish
2   priya
3    teju

pandas.core.frame.DataFrame

In [48]:
# Get the specific column data from a dataframe
print(df1.Name)

type(df1.Name)  #pandas.core.series.Series

0     manoj
1    ashish
2     priya
3      teju
Name: Name, dtype: object

pandas.core.series.Series

In [56]:
df1['Salary'] = [25000,50000,35000,72000]
df1

     Name City  Salary
0   manoj  hyd   25000
1  ashish  viz   50000
2   priya  blr   35000
3    teju  chn   72000

In [57]:
# Get  multiple columns. 
#Put desired column names in a list
get_cols = ['Name','Salary']
df1[get_cols]

     Name  Salary
0   manoj   25000
1  ashish   50000
2   priya   35000
3    teju   72000

In [63]:
#Get specific Column data in an array
df1['Name'].values
# Array means list of elements only represents using numpy package

# Generally elemnts present in 4 ways:
  # List          - Basic representation
  # NUmpy array   - Array with Numpy package representaion
  # Tensors       - Tensorflow package
  # Torch         - Pytorch package

array(['manoj', 'ashish', 'priya', 'teju'], dtype=object)

In [60]:
print(df1['Name'].values)

['manoj' 'ashish' 'priya' 'teju']

In [64]:
#List representation
list1 = [1,2,3,4]
list1

[1, 2, 3, 4]

In [65]:
import numpy as np
np.array(list1)

array([1, 2, 3, 4])

In [70]:
import numpy as np

list1 = [1,2,3,4]
list2 = [15,16,18,19]
print(list1+list2)  # Append the 2 lists elements 
np_l1 = np.array(list1)
np_l2 = np.array(list2)
print(np_l1+np_l2)   # It will add/sum the elements in the 2 lists

[1, 2, 3, 4, 15, 16, 18, 19]
[16 18 21 23]

In [73]:
list1 = [1,2,3,4,5]
list2 = [15,16,18,19]
print(list1+list2)  # Append the 2 lists elements 
np_l1 = np.array(list1)
np_l2 = np.array(list2)
print(np_l1+np_l2)

[1, 2, 3, 4, 5, 15, 16, 18, 19]

ValueError: operands could not be broadcast together with shapes (5,) (4,)

In [74]:
list1 = [1,2,3,4]
list2 = [15,16,18,19,21]
print(list1+list2)  # Append the 2 lists elements 
np_l1 = np.array(list1)
np_l2 = np.array(list2)
print(np_l1+np_l2)

[1, 2, 3, 4, 15, 16, 18, 19, 21]

ValueError: operands could not be broadcast together with shapes (4,) (5,)

In [77]:
# Add new column 'CITY2', with same values as in existing column 'City'
df1['CITY2'] = np.array(df1['City'].values)
df1

# Or
df1['CITY3'] = df1['City'].values
df1

     Name City  Salary CITY2 CITY3
0   manoj  hyd   25000   hyd   hyd
1  ashish  viz   50000   viz   viz
2   priya  blr   35000   blr   blr
3    teju  chn   72000   chn   chn

### Step 10:
Save the DataFrame
 -  DataFrames can be saved into 2 formats:
   - CSV
   - XLSX
- INorder to save any data, we need to decide 2 things:
    1) Where you want to save - Directory/Path
     2) Name of the File to be saved - Filename
     3) Extension of the file - .< extn >

In [80]:
# Case1: Save file in same path/directory.
    # No need to provide directory, as we are saving into same path
    # Directly give name of the file and extension
df1.to_csv('DatFrame1.CSV')
df1.to_excel('DataFrame1.xlsx')

#Files will be saved in same path

### Step 11:
How to Read data from a DataFrame
-

In [84]:
import pandas as pd
pd.read_csv('DatFrame1.CSV')
# Here, we will get extra column 'Unnamed: 0'

   Unnamed: 0    Name City  Salary CITY2 CITY3
0           0   manoj  hyd   25000   hyd   hyd
1           1  ashish  viz   50000   viz   viz
2           2   priya  blr   35000   blr   blr
3           3    teju  chn   72000   chn   chn

In [85]:
import pandas as pd
pd.read_excel('DataFrame1.xlsx') # Here, we will get extra column 'Unnamed: 0'

   Unnamed: 0    Name City  Salary CITY2 CITY3
0           0   manoj  hyd   25000   hyd   hyd
1           1  ashish  viz   50000   viz   viz
2           2   priya  blr   35000   blr   blr
3           3    teju  chn   72000   chn   chn

### Step 12:
How to avoid extra column while reading the data from a DataFrame
-  Extra column will be added while we save the data in a file from DataFrame
- TO avoid, use parameter index=False

In [92]:
df1.to_csv('DataFrame2.csv',index=False)
df1.to_excel('DataFrame2.xlsx',index=False)

In [97]:
#Read the data from saved files. Now no extra column will be there.
import pandas as pd
print(pd.read_csv('DataFrame2.csv'))
pd.read_excel('DataFrame2.xlsx')

     Name City  Salary CITY2 CITY3
0   manoj  hyd   25000   hyd   hyd
1  ashish  viz   50000   viz   viz
2   priya  blr   35000   blr   blr
3    teju  chn   72000   chn   chn

     Name City  Salary CITY2 CITY3
0   manoj  hyd   25000   hyd   hyd
1  ashish  viz   50000   viz   viz
2   priya  blr   35000   blr   blr
3    teju  chn   72000   chn   chn